public class UI{
    public static void startProgram(){
        System.out.println("""
                ___________________________FamilyThee___________________________
                
                1. - Добавить нового члена семьи
                2. - Показать полный список семьи
                3. - Показать родствеников по старшеству
                4. - Вополнять какие-то действия с родствениками...(не придумал)
                5. - Загрузить последнее древо
                6. - Сохранить текущее древо
                0. - Выйти из программы""");
    }
    public static void addNewMemberFamily(int chose){
        while (true){
            if (chose == 1){
                break;
            }
        }
    }

    }

